performance.yml
config:
  target: "https://api.todoist.com"
  phases:
    - duration: 3
      arrivalRate: 2
      name: "Phase 1"
  defaults:
   headers:
     Authorization: Bearer {{ $processEnvironment.TOKEN }}
     Content-type: application/json
     X-Requested-Id: $(uuidgen)
  
scenarios:
  - flow:
      - get:
          url: "/rest/v1/tasks"
      - post:
          url: "/rest/v1/tasks"
          json:
           content: "buy some groceries"
           due_string: " May 10th 2021"
           due_lang: "en"
           priority: 4
          capture:
           json: "$.id"
           as: "id"
      - log: "Current id is {{ id }}"
      - get:
          url: "/rest/v1/tasks/{{ id }}"
      - post:
          url: "/rest/v1/tasks/{{ id }}"
          json:
           content: "Better get two cats"
           priority: 1
      - post:
          url: "/rest/v1/tasks/{{ id }}/close"
      - post:
          url: "/rest/v1/tasks/{{ id }}/reopen"
      - delete:
          url: "/rest/v1/tasks/{{ id }}"
  # For more information: https://artillery.io/docs/script-reference/
# For more information: https://artillery.io/docs/script-reference/